In [3]:
import pandas as pd
import numpy as np

# #Series

In [4]:
ser=pd.Series(data=[23,45,64,34,76,64],name='Marks')
ser

0    23
1    45
2    64
3    34
4    76
5    64
Name: Marks, dtype: int64

In [5]:
#Methods
print("max:-",ser.max())
print("min:-",ser.min())
print("avg:-",ser.mean())
print(ser.agg([max,min]))

max:- 76
min:- 23
avg:- 51.0
max    76
min    23
Name: Marks, dtype: int64

In [6]:
ser.keys()

RangeIndex(start=0, stop=6, step=1)

In [7]:
ser.replace(23,43)

0    43
1    45
2    64
3    34
4    76
5    64
Name: Marks, dtype: int64

In [8]:
help(ser.apply)

Help on method apply in module pandas.core.series:

apply(func: 'AggFuncType', convert_dtype: 'bool' = True, args: 'tuple[Any, ...]' = (), **kwargs) -> 'DataFrame | Series' method of pandas.core.series.Series instance
    Invoke function on values of Series.

    Can be ufunc (a NumPy function that applies to the entire Series)
    or a Python function that only works on single values.

    Parameters
    ----------
    func : function
        Python function or NumPy ufunc to apply.
    convert_dtype : bool, default True
        Try to find better dtype for elementwise function results. If
        False, leave as dtype=object. Note that the dtype is always
        preserved for some extension array dtypes, such as Categorical.
    args : tuple
        Positional arguments passed to func after the series value.
    **kwargs
        Additional keyword arguments passed to func.

    Returns
    -------
    Series or DataFrame
        If func returns a Series object the result will be a DataFrame.

    See Also
    --------
    Series.map: For element-wise operations.
    Series.agg: Only perform aggregating type operations.
    Series.transform: Only perform transforming type operations.

    Notes
    -----
    Functions that mutate the passed object can produce unexpected
    behavior or errors and are not supported. See :ref:`gotchas.udf-mutation`
    for more details.

    Examples
    --------
    Create a series with typical summer temperatures for each city.

    >>> s = pd.Series([20, 21, 12],
    ...               index=['London', 'New York', 'Helsinki'])
    >>> s
    London      20
    New York    21
    Helsinki    12
    dtype: int64

    Square the values by defining a function and passing it as an
    argument to ``apply()``.

    >>> def square(x):
    ...     return x ** 2
    >>> s.apply(square)
    London      400
    New York    441
    Helsinki    144
    dtype: int64

    Square the values by passing an anonymous function as an
    argument to ``apply()``.

    >>> s.apply(lambda x: x ** 2)
    London      400
    New York    441
    Helsinki    144
    dtype: int64

    Define a custom function that needs additional positional
    arguments and pass these additional arguments using the
    ``args`` keyword.

    >>> def subtract_custom_value(x, custom_value):
    ...     return x - custom_value

    >>> s.apply(subtract_custom_value, args=(5,))
    London      15
    New York    16
    Helsinki     7
    dtype: int64

    Define a custom function that takes keyword arguments
    and pass these arguments to ``apply``.

    >>> def add_custom_values(x, **kwargs):
    ...     for month in kwargs:
    ...         x += kwargs[month]
    ...     return x

    >>> s.apply(add_custom_values, june=30, july=20, august=25)
    London      95
    New York    96
    Helsinki    87
    dtype: int64

    Use a function from the Numpy library.

    >>> s.apply(np.log)
    London      2.995732
    New York    3.044522
    Helsinki    2.484907
    dtype: float64

In [9]:
ser.apply(np.log)

0    3.135494
1    3.806662
2    4.158883
3    3.526361
4    4.330733
5    4.158883
Name: Marks, dtype: float64

In [10]:
ser.transpose()

0    23
1    45
2    64
3    34
4    76
5    64
Name: Marks, dtype: int64

In [11]:
ser.sum()

306

In [12]:
ser.empty

False

In [13]:
ser.map(float)

0    23.0
1    45.0
2    64.0
3    34.0
4    76.0
5    64.0
Name: Marks, dtype: float64

In [14]:
ser.count()

6

In [15]:
ser.corr

<bound method Series.corr of 0    23
1    45
2    64
3    34
4    76
5    64
Name: Marks, dtype: int64>

In [16]:
ser.nunique()

5

In [17]:
ser.abs()

0    23
1    45
2    64
3    34
4    76
5    64
Name: Marks, dtype: int64

In [18]:
print(ser.median())
print(ser.mode())
print(ser.std())

54.5
0    64
Name: Marks, dtype: int64
20.356817039999154

In [19]:
ser.unique()

array([23, 45, 64, 34, 76], dtype=int64)

# DataFrame

In [20]:
#createing DataFrame
df=pd.DataFrame({'Name':['john','tom','jeams','rhtys'],'Marks':[76,86,55,69],'grade':['A','A+','B','A']})

In [21]:
df

    Name  Marks grade
0   john     76     A
1    tom     86    A+
2  jeams     55     B
3  rhtys     69     A

In [22]:
df['Name']

0     john
1      tom
2    jeams
3    rhtys
Name: Name, dtype: object

In [23]:
df[::]

    Name  Marks grade
0   john     76     A
1    tom     86    A+
2  jeams     55     B
3  rhtys     69     A

In [24]:
df.size

12

In [25]:
df.shape

(4, 3)

In [26]:
df.columns

Index(['Name', 'Marks', 'grade'], dtype='object')

In [27]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [28]:
df.values

array([['john', 76, 'A'],
       ['tom', 86, 'A+'],
       ['jeams', 55, 'B'],
       ['rhtys', 69, 'A']], dtype=object)

In [29]:
df[['Name','grade']]

    Name grade
0   john     A
1    tom    A+
2  jeams     B
3  rhtys     A

In [30]:
df.loc[2]

Name     jeams
Marks       55
grade        B
Name: 2, dtype: object

In [31]:
df.loc[[0,1],]

   Name  Marks grade
0  john     76     A
1   tom     86    A+

In [32]:
df.loc[[1,2],'grade']

1    A+
2     B
Name: grade, dtype: object

In [33]:
df.loc[[0,2],['Name','Marks']]

    Name  Marks
0   john     76
2  jeams     55

In [34]:
df.iloc[0]

Name     john
Marks      76
grade       A
Name: 0, dtype: object

In [35]:
df.iloc[0,1]

76

In [36]:
df.iloc[[0,1],2]

0     A
1    A+
Name: grade, dtype: object

In [37]:
df.iloc[[0,2],[1,2]]

   Marks grade
0     76     A
2     55     B

In [38]:
df.describe()

           Marks
count   4.000000
mean   71.500000
std    13.025616
min    55.000000
25%    65.500000
50%    72.500000
75%    78.500000
max    86.000000

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Marks   4 non-null      int64
 2   grade   4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [40]:
df.isnull()

    Name  Marks  grade
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [41]:
df['total']=df['Marks'].apply(lambda x : 0.2*x)

In [42]:
df

    Name  Marks grade  total
0   john     76     A   15.2
1    tom     86    A+   17.2
2  jeams     55     B   11.0
3  rhtys     69     A   13.8

In [43]:
df.value_counts()

Name   Marks  grade  total
jeams  55     B      11.0     1
john   76     A      15.2     1
rhtys  69     A      13.8     1
tom    86     A+     17.2     1
dtype: int64

In [44]:
df.duplicated()

0    False
1    False
2    False
3    False
dtype: bool

In [45]:
df.drop_duplicates()

    Name  Marks grade  total
0   john     76     A   15.2
1    tom     86    A+   17.2
2  jeams     55     B   11.0
3  rhtys     69     A   13.8

In [46]:
df.rename(columns={'total':'Total'})

    Name  Marks grade  Total
0   john     76     A   15.2
1    tom     86    A+   17.2
2  jeams     55     B   11.0
3  rhtys     69     A   13.8

In [47]:
df.groupby('grade').count()

       Name  Marks  total
grade
A         2      2      2
A+        1      1      1
B         1      1      1

In [48]:
df1=pd.DataFrame({'Name':['tom','john','sakha','patil'],'Sub':['C++','Java','Python','Java']})

In [49]:
df1

    Name     Sub
0    tom     C++
1   john    Java
2  sakha  Python
3  patil    Java

In [51]:
df.merge(df1,how='left',left_on='Name',right_on='Name')

    Name  Marks grade  total   Sub
0   john     76     A   15.2  Java
1    tom     86    A+   17.2   C++
2  jeams     55     B   11.0   NaN
3  rhtys     69     A   13.8   NaN

In [52]:
df.merge(df1,how='right',left_on='Name',right_on='Name')

    Name  Marks grade  total     Sub
0    tom   86.0    A+   17.2     C++
1   john   76.0     A   15.2    Java
2  sakha    NaN   NaN    NaN  Python
3  patil    NaN   NaN    NaN    Java

In [53]:
df.merge(df1,how='outer',left_on='Name',right_on='Name')

    Name  Marks grade  total     Sub
0   john   76.0     A   15.2    Java
1    tom   86.0    A+   17.2     C++
2  jeams   55.0     B   11.0     NaN
3  rhtys   69.0     A   13.8     NaN
4  sakha    NaN   NaN    NaN  Python
5  patil    NaN   NaN    NaN    Java

In [54]:
df.merge(df1,how='inner',left_on='Name',right_on='Name')

   Name  Marks grade  total   Sub
0  john     76     A   15.2  Java
1   tom     86    A+   17.2   C++

In [57]:
df.merge(df1,how='cross')

   Name_x  Marks grade  total Name_y     Sub
0    john     76     A   15.2    tom     C++
1    john     76     A   15.2   john    Java
2    john     76     A   15.2  sakha  Python
3    john     76     A   15.2  patil    Java
4     tom     86    A+   17.2    tom     C++
5     tom     86    A+   17.2   john    Java
6     tom     86    A+   17.2  sakha  Python
7     tom     86    A+   17.2  patil    Java
8   jeams     55     B   11.0    tom     C++
9   jeams     55     B   11.0   john    Java
10  jeams     55     B   11.0  sakha  Python
11  jeams     55     B   11.0  patil    Java
12  rhtys     69     A   13.8    tom     C++
13  rhtys     69     A   13.8   john    Java
14  rhtys     69     A   13.8  sakha  Python
15  rhtys     69     A   13.8  patil    Java

In [66]:
df.query('Marks in [76,86]')

   Name  Marks grade  total
0  john     76     A   15.2
1   tom     86    A+   17.2

In [73]:
df.query("Name in ['john']")

   Name  Marks grade  total
0  john     76     A   15.2

In [74]:
df[df['grade']=='A']

    Name  Marks grade  total
0   john     76     A   15.2
3  rhtys     69     A   13.8

In [76]:
df[(df['grade']=='A' & df['Name']=='john')]

TypeError: Cannot perform 'rand_' with a dtyped [object] array and scalar of type [bool]